#### ElectricalEquipment Members

---

|  |
| --- |
| ElectricalEquipment Class   Methods   Properties   See Also |

The  ElectricalEquipment  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAssignedElectricalSystems | Retrieves the electrical systems this electrical panel currently is assigned to. (Inherited from  MEPModel  .) |
| Public method | GetCircuitNamingSchemeType | Gets enumerated type of the circuit naming scheme used with Electrical Equipment. |
| Public method | GetElectricalSystems | Retrieves the electrical systems that are currently created using this MEPModel. (Inherited from  MEPModel  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsValidCircuitNamingSchemeId | Verifies that the circuit naming scheme id can be used with Electrical Equipment. |
| Public method | IsValidDistributionSystem | Verifies that the Distribution System can be assigned to the Electrical Equipment. |
| Public method | SetCircuitNamingSchemeType | Sets the circuit naming scheme for Electrical Equipment. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CircuitNamingSchemeId | The CircuitNamingSchemeId used in the Electrical Equipment. The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment. |
| Public property | ConnectorManager | Retrieves the Connector Manager from this MEPModel. (Inherited from  MEPModel  .) |
| Public property | DistributionSystem | get or set the Distribution System for the Electrical Equipment. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | IsSwitchboard | The electrical equipment is a switchboard or not. This property returns true if the electrical equipment is a switchboard. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  MEPModel  .) |
| Public property | MaxNumberOfCircuits | The maximum number of circuits for switchboard. The quantity of circuits can be assigned to switchboard through breaker. |

# See Also

ElectricalEquipment Class

Autodesk.Revit.DB.Electrical Namespace